# შექმენით სია საიდანაც და დაპრინტეთ შუა მონაცემი.

# შექმენით სია და დაპრინტეთ დასაწყისიდან მეხუთე მონაცემის ჩათვლით.

# შექმენით სია სადაც გექნებათ სხვადასხვა ტიპის მონაცემები (str,int,float,boolean etc..) დაპრინტეთ მეხუთე მონაცემიდან ბოლომდე უარყოფითი ინდექსინგის მეშვეობით.

# შექმენით სია სადაც გექნებათ 5 მონაცემი. გაუცვალეთ ადგილები მესამე და მეოთხე მონაცემს (მონაცემის შეცვლის მეთოდით).

# შექმენით ცვლადი სადაც შეინახავთ სტრინგს "goalorientedacademy", შემდეგ დაპრინტეთ ამ ცვლადიდან მხოლოდ goal.

# შექმენით სია და შემდეგ დაპრინტეთ ეს სია შეტრიალებულად.
#1)
list=["GOA",True,900]
print(list[1])
#2)
href=[7,"x",6.457,False,True]
print(href[:5])
#3)
goa=[True,2025,False,"goa",655.958,5]
print(goa[-5:])

#4)
kilo=[11,14113,5461.655,"error",False]
kilo[3]=kilo[4]
print(kilo)
#5)
gioa="goalorientedacademy"
print(gioa)
#6)
m90=[90,"m",2.0]
print(m90[::-1])