#1) სიაში ელემენტების ინდექსირება 
#შექმენით სია, რომელიც შეიცავს 10 მონაცემცს.
#დაბეჭდეთ ელემენტები ინდექსებიდან 2-დან 5-მდე
#2) შექმენით სია სადაც შეინახავთ სხვადასხვა ტიპის მონაცემებს და შემდეგ დაპრინტეთ 3 პოზიციაზე მდოგმი მონაცემი
#3) შექმენით სია რომელიც მოიცავს თქვენს საყვარელ საჭმელს და დაპრინტეთ მხოლოდ ის item რომელიც ყველაზე მეტად გიყვართ 
#Chacha — Today at 9:58 PM
#4): ელემენტის ინდექსით მოძიება
#შექმენით სია: ["apple", "banana", "cherry", "date"]
#მოძებნეთ, რა ელემენტი დგას ინდექსზე 2 და დაბეჭდეთ იგი.
#5) სიაში პირველი ელემენტის პოვნა
#შექმენით სია: ["red", "green", "blue"]
#გამოიტანეთ პირველი ელემენტი ინდექსით
############################################################################################
#1)   
poipuma=[False,True,5895.965,645451,"y8beuncay",True,False,8362.359,256245,"91jgfh526hs"]
print(poipuma[1:4])
#2)
mmama=[False,True,5895.965,645451,"y8beuncay",True,False,8362.359,256245,"91jgfh526hs"]
print(mmama[2])
#3)
favorite_food=["xinkali","shemtvari kartopilui","mexikuri kartopili","rolles","2X big mack"]
print(favorite_food[3])
#4)
fruits=["apple", "banana", "cherry", "date"]
print(fruits[2])
#5)
colours=["red", "green", "blue"]
print(colours[1])
