


# 1) შექმენით ფუნქცია, რომელსაც ექნება 2 არგუმენტი,
# ეს რიცხვები ერთმანეთს უნდა მივუმატოთ


def add(a, b):
    return a + b

add(123321,123321)

# 2) შექმენით ფუნქცია, რომელსაც გადაეცემა 1 არგუმენტი,
# ფუნქციამ უნდა გამოიტანოს რიცხვი გამრევლებული თავის თავზე


def square(a):
    return a * a


square(100)

# 3) შექმენით ფუნქცია, რომელსაც გადაეცემა არგუმენტი სახელად name,
#  მომხმარებელმა უნდა შემოიტანოს თავისი სახელი,
# ხოლო ფუნქციის გამოძახების შემდეგ უნდა მივესალმოთ


def greet(name):
    return f"hi, {name}!_"

greet("_nikalos jaksoon")


# 4) შექმენით ფუნქცია, რომელსაც გადაეცემა 2 არგუმენტი,
# 1 არგუმენტი არის სახელი, მეორე რიცხვი,
# თუ რამდენჯერ უნდა გამოიტანოს მისალმება კოდმა

def greet(name, multiplier):
    for i in range(multiplier):
        print(f"hi, {name}")