#1) შექმენით რაიმე არასწორი list-ი და შემდგომ ეს ლისტი გაასწორეთ (მინიშნება: list[] = )
#2) შექმენით სახელების List-ი
#  და დაპრინტეთ 2 ადგილზე მყოფი 
#3) x = "science" და დამიპრინტე nice

#1)
kino=["titanik","serial","spider man ","spider man 2 "]
kino[1]="venom"
#2)
namess=["nika","tika","saba","zuka","gio"]
print(namess[2])
#3)
sience="sience"
print(sience[3]+sience[1]+sience[4]+sience[2])

#1) მარტივი სლაისინგი
#მოცემულია სია:nums = [10,20,30,40,50,60, 70]
#დავალება:
#ამოიღე სიის პირველი სამი ელემენტი.
#2)ამოიღე ბოლო ორი ელემენტი.

#1)
nums = [10,20,30,40,50,60,70]
print(nums[0:3])
#2)
print(nums[5:7])

#1) მარტივი სლაისინგი
#მოცემულია სია:nums = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
#2) დაპრინტეთ მ
#ხოლოდ 4 დან 7 ის ჩათვლით

#1)
nums = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(nums[3:7])