
# ა) ამოიღეთ სიის პირველი ოთხი ელემენტი.
# ბ) ამოიღეთ სიის ბოლო სამი ელემენტი.
# გ) ამოიღეთ სიის შუა სამი ელემენტი.
# მოცემულია სია: letters = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h']

# ა) დაბეჭდეთ სიის თითოეული მეორე ელემენტი.
# ბ) დაბეჭდეთ სიის ელემენტები უკუღმა.
# გ) ამოიღეთ მხოლოდ ['c', 'd', 'e'].
# მოცემულია სია: nums = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]


#1)

#ა)
letters = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h']
print(letters[0:4])
#ბ)
print(letters[5:8])
#გ)
print(letters[2:5])

#_______________________________________________________________________________________________________________________
#-----------------------------------------------------------------------------------------------------------------------
#2) 
nums = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

#ა)
print(nums[1]) 
print(nums[3])
print(nums[5])
print(nums[7])
print(nums[9])

#ბ)
print(nums[9])
print(nums[8])
print(nums[7])
print(nums[6])
print(nums[5])
print(nums[4])
print(nums[3])
print(nums[2])
print(nums[1])
print(nums[0])

#გ)
print(nums[2])
print(nums[3])
print(nums[4])
